# Pandas 06 - Add/Remove rows and columns.

In [1]:
import pandas as pd

In [2]:
persons = {
    'Name': ['Diana','Claudia', 'Samsa', 'HP'],
    'Last': ['Ramirez', 'Devo', 'Stark', 'Lovecraft'],
    'Email': ['dna@g.com', 'cdevo@edu.mx', 'knife@end.bad', 'hpl@necronomicon.edu']
}
df = pd.DataFrame(persons)

In [3]:
df

      Name       Last                 Email
0    Diana    Ramirez             dna@g.com
1  Claudia       Devo          cdevo@edu.mx
2    Samsa      Stark         knife@end.bad
3       HP  Lovecraft  hpl@necronomicon.edu

In [4]:
# concatenar dos columnas y obtener el nombre completo
df['Name'] +' '+ df['Last']

0    Diana Ramirez
1     Claudia Devo
2      Samsa Stark
3     HP Lovecraft
dtype: object

In [5]:
# crear una nueva columna Full_name con Name y Last
df['Full_name'] = df['Name'] +' '+ df['Last']

In [6]:
df

      Name       Last                 Email      Full_name
0    Diana    Ramirez             dna@g.com  Diana Ramirez
1  Claudia       Devo          cdevo@edu.mx   Claudia Devo
2    Samsa      Stark         knife@end.bad    Samsa Stark
3       HP  Lovecraft  hpl@necronomicon.edu   HP Lovecraft

### Eliminando columnas

In [7]:
# eliminar columnas con drop
df.drop(columns=['Name', 'Last'])

                  Email      Full_name
0             dna@g.com  Diana Ramirez
1          cdevo@edu.mx   Claudia Devo
2         knife@end.bad    Samsa Stark
3  hpl@necronomicon.edu   HP Lovecraft

In [8]:
df

      Name       Last                 Email      Full_name
0    Diana    Ramirez             dna@g.com  Diana Ramirez
1  Claudia       Devo          cdevo@edu.mx   Claudia Devo
2    Samsa      Stark         knife@end.bad    Samsa Stark
3       HP  Lovecraft  hpl@necronomicon.edu   HP Lovecraft

Como se puede ver, el metodo anterior regresa un DataFrame sin las columnas eliminadas, pero no mantiene los cambios, para aplicar los cambios se debe usar el metodo inplace=True

In [9]:
df['Full_name'].str.split()

0    [Diana, Ramirez]
1     [Claudia, Devo]
2      [Samsa, Stark]
3     [HP, Lovecraft]
Name: Full_name, dtype: object

In [10]:
# usar lo anterior pero devolver un DataFrame con dos columnas
df['Full_name'].str.split(expand=True)

         0          1
0    Diana    Ramirez
1  Claudia       Devo
2    Samsa      Stark
3       HP  Lovecraft

In [11]:
# eliminar columnas
df.drop(columns=['Name', 'Last'], inplace=True)

In [12]:
df

                  Email      Full_name
0             dna@g.com  Diana Ramirez
1          cdevo@edu.mx   Claudia Devo
2         knife@end.bad    Samsa Stark
3  hpl@necronomicon.edu   HP Lovecraft

In [13]:
# ahora con el full name volvemos a crear la columna de Name y Last
cp1 = df
cp1[['First', 'Last']] = cp1['Full_name'].str.split(expand=True)

In [14]:
# coloca las columnas al final
cp1

                  Email      Full_name    First       Last
0             dna@g.com  Diana Ramirez    Diana    Ramirez
1          cdevo@edu.mx   Claudia Devo  Claudia       Devo
2         knife@end.bad    Samsa Stark    Samsa      Stark
3  hpl@necronomicon.edu   HP Lovecraft       HP  Lovecraft

In [15]:
# crear un DataFrame del full name
op = df['Full_name'].str.split(expand=True)
pr = pd.DataFrame(op)

In [16]:
pr

         0          1
0    Diana    Ramirez
1  Claudia       Devo
2    Samsa      Stark
3       HP  Lovecraft

In [17]:
# renombrar las columnas
pr.rename(columns={0: 'Name',1:'Last'}, inplace=True)
pr.drop(columns=['Last'], inplace=True)

In [18]:
# usar el metodo append
df = pd.DataFrame(persons)

In [19]:
df = df.append({'Name':'Arley'}, ignore_index=True)
df

      Name       Last                 Email
0    Diana    Ramirez             dna@g.com
1  Claudia       Devo          cdevo@edu.mx
2    Samsa      Stark         knife@end.bad
3       HP  Lovecraft  hpl@necronomicon.edu
4    Arley        NaN                   NaN

In [20]:
# a√±adir un nuevo registro
df = df.append({'Name':'Mike','Last':'River', 'Email':'mriv@edu.net'}, ignore_index=True)
df

      Name       Last                 Email
0    Diana    Ramirez             dna@g.com
1  Claudia       Devo          cdevo@edu.mx
2    Samsa      Stark         knife@end.bad
3       HP  Lovecraft  hpl@necronomicon.edu
4    Arley        NaN                   NaN
5     Mike      River          mriv@edu.net

In [21]:
# eliminar uno o mas registros
df.drop(index=3, inplace=True)

In [22]:
df

      Name     Last          Email
0    Diana  Ramirez      dna@g.com
1  Claudia     Devo   cdevo@edu.mx
2    Samsa    Stark  knife@end.bad
4    Arley      NaN            NaN
5     Mike    River   mriv@edu.net

In [23]:
# eliminacion por condicion
df.drop(index=df[df['Name'] == 'Claudia'].index)

    Name     Last          Email
0  Diana  Ramirez      dna@g.com
2  Samsa    Stark  knife@end.bad
4  Arley      NaN            NaN
5   Mike    River   mriv@edu.net